pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_ipct.h
#if NRF_IPCT_HAS_ACK
/** @brief IPCT shortcuts. */
typedef enum
{
    NRF_IPCT_SHORT_RECEIVE0_ACK0_MASK   = IPCT_SHORTS_RECEIVE0_ACK0_Msk,
    NRF_IPCT_SHORT_RECEIVE1_ACK1_MASK   = IPCT_SHORTS_RECEIVE1_ACK1_Msk,
    NRF_IPCT_SHORT_RECEIVE2_ACK2_MASK   = IPCT_SHORTS_RECEIVE2_ACK2_Msk,
    NRF_IPCT_SHORT_RECEIVE3_ACK3_MASK   = IPCT_SHORTS_RECEIVE3_ACK3_Msk,
    NRF_IPCT_SHORT_RECEIVE4_ACK4_MASK   = IPCT_SHORTS_RECEIVE4_ACK4_Msk,
    NRF_IPCT_SHORT_RECEIVE5_ACK5_MASK   = IPCT_SHORTS_RECEIVE5_ACK5_Msk,
    NRF_IPCT_SHORT_RECEIVE6_ACK6_MASK   = IPCT_SHORTS_RECEIVE6_ACK6_Msk,
    NRF_IPCT_SHORT_RECEIVE7_ACK7_MASK   = IPCT_SHORTS_RECEIVE7_ACK7_Msk,
    NRF_IPCT_SHORT_RECEIVE8_ACK8_MASK   = IPCT_SHORTS_RECEIVE8_ACK8_Msk,
    NRF_IPCT_SHORT_RECEIVE9_ACK9_MASK   = IPCT_SHORTS_RECEIVE9_ACK9_Msk,
    NRF_IPCT_SHORT_RECEIVE10_ACK10_MASK = IPCT_SHORTS_RECEIVE10_ACK10_Msk,
    NRF_IPCT_SHORT_RECEIVE11_ACK11_MASK = IPCT_SHORTS_RECEIVE11_ACK11_Msk,
    NRF_IPCT_SHORT_RECEIVE12_ACK12_MASK = IPCT_SHORTS_RECEIVE12_ACK12_Msk,
    NRF_IPCT_SHORT_RECEIVE13_ACK13_MASK = IPCT_SHORTS_RECEIVE13_ACK13_Msk,
    NRF_IPCT_SHORT_RECEIVE14_ACK14_MASK = IPCT_SHORTS_RECEIVE14_ACK14_Msk,
    NRF_IPCT_SHORT_RECEIVE15_ACK15_MASK = IPCT_SHORTS_RECEIVE15_ACK15_Msk,
    NRF_IPCT_ALL_SHORTS_MASK            = NRF_IPCT_SHORT_RECEIVE0_ACK0_MASK   |
                                          NRF_IPCT_SHORT_RECEIVE1_ACK1_MASK   |
                                          NRF_IPCT_SHORT_RECEIVE2_ACK2_MASK   |
                                          NRF_IPCT_SHORT_RECEIVE3_ACK3_MASK   |
                                          NRF_IPCT_SHORT_RECEIVE4_ACK4_MASK   |
                                          NRF_IPCT_SHORT_RECEIVE5_ACK5_MASK   |
                                          NRF_IPCT_SHORT_RECEIVE6_ACK6_MASK   |
                                          NRF_IPCT_SHORT_RECEIVE7_ACK7_MASK   |
                                          NRF_IPCT_SHORT_RECEIVE8_ACK8_MASK   |
                                          NRF_IPCT_SHORT_RECEIVE9_ACK9_MASK   |
                                          NRF_IPCT_SHORT_RECEIVE10_ACK10_MASK |
                                          NRF_IPCT_SHORT_RECEIVE11_ACK11_MASK |
                                          NRF_IPCT_SHORT_RECEIVE12_ACK12_MASK |
                                          NRF_IPCT_SHORT_RECEIVE13_ACK13_MASK |
                                          NRF_IPCT_SHORT_RECEIVE14_ACK14_MASK |
                                          NRF_IPCT_SHORT_RECEIVE15_ACK15_MASK,
} nrf_ipct_short_mask_t;
#endif

/** @brief IPCT interrupts. */
typedef enum
{
    NRF_IPCT_INT_RECEIVE_0  = IPCT_INTEN0_RECEIVE0_Msk,
    NRF_IPCT_INT_RECEIVE_1  = IPCT_INTEN0_RECEIVE1_Msk,
    NRF_IPCT_INT_RECEIVE_2  = IPCT_INTEN0_RECEIVE2_Msk,
    NRF_IPCT_INT_RECEIVE_3  = IPCT_INTEN0_RECEIVE3_Msk,
#if NRF_IPCT_EVENTS_RECEIVE_COUNT > 4
    NRF_IPCT_INT_RECEIVE_4  = IPCT_INTEN0_RECEIVE4_Msk,
    NRF_IPCT_INT_RECEIVE_5  = IPCT_INTEN0_RECEIVE5_Msk,
    NRF_IPCT_INT_RECEIVE_6  = IPCT_INTEN0_RECEIVE6_Msk,
    NRF_IPCT_INT_RECEIVE_7  = IPCT_INTEN0_RECEIVE7_Msk,
    NRF_IPCT_INT_RECEIVE_8  = IPCT_INTEN0_RECEIVE8_Msk,
    NRF_IPCT_INT_RECEIVE_9  = IPCT_INTEN0_RECEIVE9_Msk,
    NRF_IPCT_INT_RECEIVE_10 = IPCT_INTEN0_RECEIVE10_Msk,
    NRF_IPCT_INT_RECEIVE_11 = IPCT_INTEN0_RECEIVE11_Msk,
    NRF_IPCT_INT_RECEIVE_12 = IPCT_INTEN0_RECEIVE12_Msk,
    NRF_IPCT_INT_RECEIVE_13 = IPCT_INTEN0_RECEIVE13_Msk,
    NRF_IPCT_INT_RECEIVE_14 = IPCT_INTEN0_RECEIVE14_Msk,
    NRF_IPCT_INT_RECEIVE_15 = IPCT_INTEN0_RECEIVE15_Msk,
#endif
#if NRF_IPCT_HAS_ACK
    NRF_IPCT_INT_ACKED_0    = IPCT_INTEN0_ACKED0_Msk,
    NRF_IPCT_INT_ACKED_1    = IPCT_INTEN0_ACKED1_Msk,
    NRF_IPCT_INT_ACKED_2    = IPCT_INTEN0_ACKED2_Msk,
    NRF_IPCT_INT_ACKED_3    = IPCT_INTEN0_ACKED3_Msk,
    NRF_IPCT_INT_ACKED_4    = IPCT_INTEN0_ACKED4_Msk,
    NRF_IPCT_INT_ACKED_5    = IPCT_INTEN0_ACKED5_Msk,
    NRF_IPCT_INT_ACKED_6    = IPCT_INTEN0_ACKED6_Msk,
    NRF_IPCT_INT_ACKED_7    = IPCT_INTEN0_ACKED7_Msk,
    NRF_IPCT_INT_ACKED_8    = IPCT_INTEN0_ACKED8_Msk,
    NRF_IPCT_INT_ACKED_9    = IPCT_INTEN0_ACKED9_Msk,
    NRF_IPCT_INT_ACKED_10   = IPCT_INTEN0_ACKED10_Msk,
    NRF_IPCT_INT_ACKED_11   = IPCT_INTEN0_ACKED11_Msk,
    NRF_IPCT_INT_ACKED_12   = IPCT_INTEN0_ACKED12_Msk,
    NRF_IPCT_INT_ACKED_13   = IPCT_INTEN0_ACKED13_Msk,
    NRF_IPCT_INT_ACKED_14   = IPCT_INTEN0_ACKED14_Msk,
    NRF_IPCT_INT_ACKED_15   = IPCT_INTEN0_ACKED15_Msk,
#endif
} nrf_ipct_int_mask_t;

/**
 * @brief Function for triggering the specified IPCT task.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Task to be triggered.
 */
NRF_STATIC_INLINE void nrf_ipct_task_trigger(NRF_IPCT_Type * p_reg, nrf_ipct_task_t task);

/**
 * @brief Function for getting the address of the specified IPCT task register.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Specified task.
 *
 * @return Address of the specified task register.
 */
NRF_STATIC_INLINE uint32_t nrf_ipct_task_address_get(NRF_IPCT_Type const * p_reg,
                                                     nrf_ipct_task_t       task);

/**
 * @brief Function for clearing the specified IPCT event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to clear.
 */
NRF_STATIC_INLINE void nrf_ipct_event_clear(NRF_IPCT_Type * p_reg, nrf_ipct_event_t event);

/**
 * @brief Function for retrieving the state of the IPCT event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to be checked.
 *
 * @retval true  The event has been generated.
 * @retval false The event has not been generated.
 */
NRF_STATIC_INLINE bool nrf_ipct_event_check(NRF_IPCT_Type const * p_reg, nrf_ipct_event_t event);

/**
 * @brief Function for getting the address of the specified IPCT event register.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Specified event.
 *
 * @return Address of the specified event register.
 */
NRF_STATIC_INLINE uint32_t nrf_ipct_event_address_get(NRF_IPCT_Type const * p_reg,
                                                      nrf_ipct_event_t      event);

/**
 * @brief Function for enabling specified interrupts.
 *
 * @param[in] p_reg     Pointer to the structure of registers of the peripheral.
 * @param[in] group_idx Index of interrupt group to be enabled.
 * @param[in] mask      Mask of interrupts to be enabled.
 *                      Use @ref nrf_ipct_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_ipct_int_enable(NRF_IPCT_Type * p_reg,
                                           uint8_t         group_idx,
                                           uint32_t        mask);

/**
 * @brief Function for disabling specified interrupts.
 *
 * @param[in] p_reg     Pointer to the structure of registers of the peripheral.
 * @param[in] group_idx Index of interrupt group to be disabled.
 * @param[in] mask      Mask of interrupts to be disabled.
 *                      Use @ref nrf_ipct_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_ipct_int_disable(NRF_IPCT_Type * p_reg,
                                            uint8_t         group_idx,
                                            uint32_t        mask);

/**
 * @brief Function for checking if the specified interrupts are enabled.
 *
 * @param[in] p_reg     Pointer to the structure of registers of the peripheral.
 * @param[in] group_idx Index of interrupt group to be checked.
 * @param[in] mask      Mask of interrupts to be checked.
 *                      Use @ref nrf_ipct_int_mask_t values for bit masking.
 *
 * @return Mask of enabled interrupts.
 */
NRF_STATIC_INLINE uint32_t nrf_ipct_int_enable_check(NRF_IPCT_Type const * p_reg,
                                                     uint8_t               group_idx,
                                                     uint32_t              mask);

/**
 * @brief Function for retrieving the state of pending interrupts.
 *
 * States of pending interrupt are saved as a bitmask.
 * One set at particular position means that interrupt for event is pending.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] group_idx Index of interrupt group to be retrieved.
 *
 * @return Bitmask with information about pending interrupts.
 *         Use @ref nrf_ipct_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE uint32_t nrf_ipct_int_pending_get(NRF_IPCT_Type const * p_reg,
                                                    uint8_t               group_idx);

/**
 *
 * @brief Function for setting the DPPI subscribe configuration for a given
 *        IPCT task.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] task    Task for which to set the configuration.
 * @param[in] channel DPPI channel through which to subscribe events.
 */
NRF_STATIC_INLINE void nrf_ipct_subscribe_set(NRF_IPCT_Type * p_reg,
                                              nrf_ipct_task_t task,
                                              uint8_t         channel);

/**
 * @brief Function for clearing the DPPI subscribe configuration for a given
 *        IPCT task.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Task for which to clear the configuration.
 */
NRF_STATIC_INLINE void nrf_ipct_subscribe_clear(NRF_IPCT_Type * p_reg, nrf_ipct_task_t task);

/**
 * @brief Function for setting the DPPI publish configuration for a given
 *        IPCT event.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] event   Event for which to set the configuration.
 * @param[in] channel DPPI channel through which to publish the event.
 */
NRF_STATIC_INLINE void nrf_ipct_publish_set(NRF_IPCT_Type *  p_reg,
                                           nrf_ipct_event_t event,
                                           uint8_t         channel);

/**
 * @brief Function for clearing the DPPI publish configuration for a given
 *        IPCT event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event for which to clear the configuration.
 */
NRF_STATIC_INLINE void nrf_ipct_publish_clear(NRF_IPCT_Type * p_reg, nrf_ipct_event_t event);

/**
 * @brief Function for getting value of the task overflow status for SEND task.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index SEND task index to be checked.
 *
 * @retval true  Task overflow has happened.
 * @retval false Task overflow has not happened.
 */
NRF_STATIC_INLINE bool nrf_ipct_overflow_send_get(NRF_IPCT_Type const * p_reg, uint8_t index);

/**
 * @brief Function for getting SEND task by its index.
 *
 * @param[in] index Index of the SEND task.
 *
 * @return SEND task.
 */
NRF_STATIC_INLINE nrf_ipct_task_t nrf_ipct_send_task_get(uint8_t index);

/**
 * @brief Function for getting ACK task by its index.
 *
 * @param[in] index Index of the ACK task.
 *
 * @return ACK task.
 */
NRF_STATIC_INLINE nrf_ipct_task_t nrf_ipct_ack_task_get(uint8_t index);

/**
 * @brief Function for getting RECEIVE event by its index.
 *
 * @param[in] index Index of the RECEIVE event.
 *
 * @return RECEIVE event.
 */
NRF_STATIC_INLINE nrf_ipct_event_t nrf_ipct_receive_event_get(uint8_t index);

/**
 * @brief Function for getting ACKED event by its index.
 *
 * @param[in] index Index of the ACKED event.
 *
 * @return ACKED event.
 */
NRF_STATIC_INLINE nrf_ipct_event_t nrf_ipct_acked_event_get(uint8_t index);

/**
 * @brief Function for enabling the specified shortcuts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Shortcuts to be enabled.
 */
NRF_STATIC_INLINE void nrf_ipct_shorts_enable(NRF_IPCT_Type * p_reg, uint32_t mask);

/**
 * @brief Function for disabling the specified shortcuts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Shortcuts to be disabled.
 */
NRF_STATIC_INLINE void nrf_ipct_shorts_disable(NRF_IPCT_Type * p_reg, uint32_t mask);

/**
 * @brief Function for setting the configuration of IPCT shortcuts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Shortcuts to be set.
 */
NRF_STATIC_INLINE void nrf_ipct_shorts_set(NRF_IPCT_Type * p_reg, uint32_t mask);

#ifndef NRF_DECLARE_ONLY

