pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_ipct.h
NRF_STATIC_INLINE void nrf_ipct_task_trigger(NRF_IPCT_Type * p_reg, nrf_ipct_task_t task)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)task)) = 0x1UL;
}

NRF_STATIC_INLINE uint32_t nrf_ipct_task_address_get(NRF_IPCT_Type const * p_reg,
                                                     nrf_ipct_task_t       task)
{
    return ((uint32_t)p_reg + (uint32_t)task);
}

NRF_STATIC_INLINE void nrf_ipct_event_clear(NRF_IPCT_Type * p_reg, nrf_ipct_event_t event)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event)) = 0x0UL;
}

NRF_STATIC_INLINE bool nrf_ipct_event_check(NRF_IPCT_Type const * p_reg, nrf_ipct_event_t event)
{
    return nrf_event_check(p_reg, event);
}

NRF_STATIC_INLINE uint32_t nrf_ipct_event_address_get(NRF_IPCT_Type const * p_reg,
                                                      nrf_ipct_event_t      event)
{
    return ((uint32_t)p_reg + (uint32_t)event);
}

NRF_STATIC_INLINE void nrf_ipct_int_enable(NRF_IPCT_Type * p_reg,
                                           uint8_t         group_idx,
                                           uint32_t        mask)
{
    switch (group_idx)
    {
#if defined(IPCT_INTENSET0_ResetValue)
        case 0:
            p_reg->INTENSET0 = mask;
            break;
#endif // IPCT_INTENSET0_ResetValue
#if defined(IPCT_INTENSET1_ResetValue)
        case 1:
            p_reg->INTENSET1 = mask;
            break;
#endif // IPCT_INTENSET1_ResetValue
#if defined(IPCT_INTENSET2_ResetValue)
        case 2:
            p_reg->INTENSET2 = mask;
            break;
#endif // IPCT_INTENSET2_ResetValue
#if defined(IPCT_INTENSET3_ResetValue)
        case 3:
            p_reg->INTENSET3 = mask;
            break;
#endif // IPCT_INTENSET3_ResetValue
#if defined(IPCT_INTENSET4_ResetValue)
        case 4:
            p_reg->INTENSET4 = mask;
            break;
#endif // IPCT_INTENSET4_ResetValue
#if defined(IPCT_INTENSET5_ResetValue)
        case 5:
            p_reg->INTENSET5 = mask;
            break;
#endif // IPCT_INTENSET5_ResetValue
#if defined(IPCT_INTENSET6_ResetValue)
        case 6:
            p_reg->INTENSET6 = mask;
            break;
#endif // IPCT_INTENSET6_ResetValue
#if defined(IPCT_INTENSET7_ResetValue)
        case 7:
            p_reg->INTENSET7 = mask;
            break;
#endif // IPCT_INTENSET7_ResetValue
        default:
            NRFX_ASSERT(false);
            break;
    }
}

NRF_STATIC_INLINE void nrf_ipct_int_disable(NRF_IPCT_Type * p_reg,
                                            uint8_t         group_idx,
                                            uint32_t        mask)
{
    switch (group_idx)
    {
#if defined(IPCT_INTENCLR0_ResetValue)
        case 0:
            p_reg->INTENCLR0 = mask;
            break;
#endif // IPCT_INTENCLR0_ResetValue
#if defined(IPCT_INTENCLR1_ResetValue)
        case 1:
            p_reg->INTENCLR1 = mask;
            break;
#endif // IPCT_INTENCLR1_ResetValue
#if defined(IPCT_INTENCLR2_ResetValue)
        case 2:
            p_reg->INTENCLR2 = mask;
            break;
#endif // IPCT_INTENCLR2_ResetValue
#if defined(IPCT_INTENCLR3_ResetValue)
        case 3:
            p_reg->INTENCLR3 = mask;
            break;
#endif // IPCT_INTENCLR3_ResetValue
#if defined(IPCT_INTENCLR4_ResetValue)
        case 4:
            p_reg->INTENCLR4 = mask;
            break;
#endif // IPCT_INTENCLR4_ResetValue
#if defined(IPCT_INTENCLR5_ResetValue)
        case 5:
            p_reg->INTENCLR5 = mask;
            break;
#endif // IPCT_INTENCLR5_ResetValue
        #if defined(IPCT_INTENCLR6_ResetValue)
        case 6:
            p_reg->INTENCLR6 = mask;
            break;
#endif // IPCT_INTENCLR6_ResetValue
#if defined(IPCT_INTENCLR7_ResetValue)
        case 7:
            p_reg->INTENCLR7 = mask;
            break;
#endif // IPCT_INTENCLR7_ResetValue
        default:
            NRFX_ASSERT(false);
            break;
    }
}

NRF_STATIC_INLINE uint32_t nrf_ipct_int_enable_check(NRF_IPCT_Type const * p_reg,
                                                     uint8_t               group_idx,
                                                     uint32_t              mask)
{
    switch (group_idx)
    {
#if defined(IPCT_INTENSET0_ResetValue)
        case 0:
            return p_reg->INTENSET0 & mask;
#endif // IPCT_INTENSET0_ResetValue
#if defined(IPCT_INTENSET1_ResetValue)
        case 1:
            return p_reg->INTENSET1 & mask;
#endif // IPCT_INTENSET1_ResetValue
#if defined(IPCT_INTENSET2_ResetValue)
        case 2:
            return p_reg->INTENSET2 & mask;
#endif // IPCT_INTENSET2_ResetValue
#if defined(IPCT_INTENSET3_ResetValue)
        case 3:
            return p_reg->INTENSET3 & mask;
#endif // IPCT_INTENSET3_ResetValue
#if defined(IPCT_INTENSET4_ResetValue)
        case 4:
            return p_reg->INTENSET4 & mask;
#endif // IPCT_INTENSET4_ResetValue
#if defined(IPCT_INTENSET5_ResetValue)
        case 5:
            return p_reg->INTENSET5 & mask;
#endif // IPCT_INTENSET5_ResetValue
#if defined(IPCT_INTENSET6_ResetValue)
        case 6:
            return p_reg->INTENSET6 & mask;
#endif // IPCT_INTENSET6_ResetValue
#if defined(IPCT_INTENSET7_ResetValue)
        case 7:
            return p_reg->INTENSET7 & mask;
#endif // IPCT_INTENSET7_ResetValue
        default:
            NRFX_ASSERT(false);
            return 0;
    }
}

NRF_STATIC_INLINE uint32_t nrf_ipct_int_pending_get(NRF_IPCT_Type const * p_reg,
                                                    uint8_t               group_idx)
{
    switch (group_idx)
    {
#if defined(IPCT_INTPEND0_ResetValue)
        case 0:
            return p_reg->INTPEND0;
#endif // IPCT_INTPEND0_ResetValue
#if defined(IPCT_INTPEND1_ResetValue)
        case 1:
            return p_reg->INTPEND1;
#endif // IPCT_INTPEND1_ResetValue
#if defined(IPCT_INTPEND2_ResetValue)
        case 2:
            return p_reg->INTPEND2;
#endif // IPCT_INTPEND2_ResetValue
#if defined(IPCT_INTPEND3_ResetValue)
        case 3:
            return p_reg->INTPEND3;
#endif // IPCT_INTPEND3_ResetValue
#if defined(IPCT_INTPEND4_ResetValue)
        case 4:
            return p_reg->INTPEND4;
#endif // IPCT_INTPEND4_ResetValue
#if defined(IPCT_INTPEND5_ResetValue)
        case 5:
            return p_reg->INTPEND5;
#endif // IPCT_INTPEND5_ResetValue
#if defined(IPCT_INTPEND6_ResetValue)
        case 6:
            return p_reg->INTPEND6;
#endif // IPCT_INTPEND6_ResetValue
#if defined(IPCT_INTPEND7_ResetValue)
        case 7:
            return p_reg->INTPEND7;
#endif // IPCT_INTPEND7_ResetValue
        default:
            NRFX_ASSERT(false);
            return 0;
    }
}

NRF_STATIC_INLINE void nrf_ipct_subscribe_set(NRF_IPCT_Type * p_reg,
                                             nrf_ipct_task_t task,
                                             uint8_t        channel)
{
    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) task + 0x80uL)) =
            ((uint32_t)channel | NRF_SUBSCRIBE_PUBLISH_ENABLE);
}

NRF_STATIC_INLINE void nrf_ipct_subscribe_clear(NRF_IPCT_Type * p_reg, nrf_ipct_task_t task)
{
    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) task + 0x80uL)) = 0;
}

NRF_STATIC_INLINE void nrf_ipct_publish_set(NRF_IPCT_Type *  p_reg,
                                           nrf_ipct_event_t event,
                                           uint8_t         channel)
{
    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) event + 0x80uL)) =
            ((uint32_t)channel | NRF_SUBSCRIBE_PUBLISH_ENABLE);
}

NRF_STATIC_INLINE void nrf_ipct_publish_clear(NRF_IPCT_Type *  p_reg, nrf_ipct_event_t event)
{
    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) event + 0x80uL)) = 0;
}

NRF_STATIC_INLINE bool nrf_ipct_overflow_send_get(NRF_IPCT_Type const * p_reg, uint8_t index)
{
    NRFX_ASSERT(index < NRF_IPCT_TASKS_SEND_COUNT);
    return (p_reg->OVERFLOW.SEND & (1uL << index));
}

NRF_STATIC_INLINE nrf_ipct_task_t nrf_ipct_send_task_get(uint8_t index)
{
    return (nrf_ipct_task_t)(NRFX_OFFSETOF(NRF_IPCT_Type, TASKS_SEND[index]));
}

NRF_STATIC_INLINE nrf_ipct_task_t nrf_ipct_ack_task_get(uint8_t index)
{
#if NRF_IPCT_HAS_ACK
    return (nrf_ipct_task_t)(NRFX_OFFSETOF(NRF_IPCT_Type, TASKS_ACK[index]));
#else
    (void)index;
    return (nrf_ipct_task_t)0;
#endif
}

NRF_STATIC_INLINE nrf_ipct_event_t nrf_ipct_receive_event_get(uint8_t index)
{
    return (nrf_ipct_event_t)(NRFX_OFFSETOF(NRF_IPCT_Type, EVENTS_RECEIVE[index]));
}

NRF_STATIC_INLINE nrf_ipct_event_t nrf_ipct_acked_event_get(uint8_t index)
{
#if NRF_IPCT_HAS_ACK
    return (nrf_ipct_event_t)(NRFX_OFFSETOF(NRF_IPCT_Type, EVENTS_ACKED[index]));
#else
    (void)index;
    return (nrf_ipct_event_t)0;
#endif
}

NRF_STATIC_INLINE void nrf_ipct_shorts_enable(NRF_IPCT_Type * p_reg, uint32_t mask)
{
    p_reg->SHORTS |= mask;
}

NRF_STATIC_INLINE void nrf_ipct_shorts_disable(NRF_IPCT_Type * p_reg, uint32_t mask)
{
    p_reg->SHORTS &= ~(mask);
}

NRF_STATIC_INLINE void nrf_ipct_shorts_set(NRF_IPCT_Type * p_reg, uint32_t mask)
{
    p_reg->SHORTS = mask;
}

#endif // NRF_DECLARE_ONLY

/** @} */

#ifdef __cplusplus
}
#endif

#endif // NRF_IPCT_H__
